CSI API ETABS v1
cDesignCompositeBeam.SetComboDeflection Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetComboDeflection(
	string Name,
	bool Selected
)
Function SetComboDeflection (
	Name As String,
	Selected As Boolean
) As Integer
Dim instance As cDesignCompositeBeam
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.SetComboDeflection(Name,
	Selected)
int SetComboDeflection(
	String^ Name,
	bool Selected
)
abstract SetComboDeflection :
        Name : string *
        Selected : bool -> int
Parameters
Name
Type: System.String
Selected
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignCompositeBeam Interface
ETABSv1 Namespace